{
    "hi": "Hello! How can I assist you today? 😊",
    "hello": "Hi there! How can I help? 🏡",
    "how are you": "I'm here to help with all your real estate queries! 🚀",
    "property listings": "You can view all available properties on our website. Would you like filters by price or location?",
    "latest properties": "Our latest listings include apartments, villas, and commercial spaces. Would you like to see residential or commercial properties?",
    "house prices": "House prices vary by location and size. Can you specify an area?",
    "affordable homes": "We have budget-friendly homes starting at ₹25L. Would you like to see options?",
    "luxury apartments": "Our premium properties include penthouses and villas with sea views. Interested?",
    "mortgage details": "Mortgage rates vary by lender. Would you like help finding a bank with the best rates?",
    "home loan eligibility": "Eligibility depends on income, credit score, and employment status. Would you like a loan calculator?",
    "interest rates": "Current home loan interest rates range from 7% to 9%. Would you like specific lender details?",
    "rent vs buy": "It depends on your goals. Renting offers flexibility, while buying builds equity.",
    "contact agent": "Sure! Please provide your contact details, and an agent will reach out soon.",
    "schedule visit": "You can book a property visit on our website. Select a date and time that works for you.",
    "legal documents": "Buying a home requires an agreement, registration, and title deed verification. Need assistance?",
    "best locations": "Top locations include Ahmedabad, Mumbai, and Bangalore. Which city are you interested in?",
    "neighborhood guide": "Each area has unique benefits. Would you like a guide on schools, hospitals, and entertainment nearby?",
    "investment properties": "Real estate investments in commercial spaces and rental apartments offer good returns. Would you like recommendations?",
    "selling property": "We can assist with listing and finding buyers. Would you like to list your property?",
    "real estate trends": "Market trends show a 7-10% annual growth. Would you like investment advice?",
    "thanks": "You're welcome! Let me know if you need anything else. 😊",
    "query_1": "Automated response for query 1, providing details on real estate.",
    "query_2": "Automated response for query 2, providing details on real estate.",
    "query_3": "Automated response for query 3, providing details on real estate.",
    "query_4": "Automated response for query 4, providing details on real estate.",
    "query_5": "Automated response for query 5, providing details on real estate.",
    "query_6": "Automated response for query 6, providing details on real estate.",
    "query_7": "Automated response for query 7, providing details on real estate.",
    "query_8": "Automated response for query 8, providing details on real estate.",
    "query_9": "Automated response for query 9, providing details on real estate.",
    "query_10": "Automated response for query 10, providing details on real estate.",
    "query_11": "Automated response for query 11, providing details on real estate.",
    "query_12": "Automated response for query 12, providing details on real estate.",
    "query_13": "Automated response for query 13, providing details on real estate.",
    "query_14": "Automated response for query 14, providing details on real estate.",
    "query_15": "Automated response for query 15, providing details on real estate.",
    "query_16": "Automated response for query 16, providing details on real estate.",
    "query_17": "Automated response for query 17, providing details on real estate.",
    "query_18": "Automated response for query 18, providing details on real estate.",
    "query_19": "Automated response for query 19, providing details on real estate.",
    "query_20": "Automated response for query 20, providing details on real estate.",
    "query_21": "Automated response for query 21, providing details on real estate.",
    "query_22": "Automated response for query 22, providing details on real estate.",
    "query_23": "Automated response for query 23, providing details on real estate.",
    "query_24": "Automated response for query 24, providing details on real estate.",
    "query_25": "Automated response for query 25, providing details on real estate.",
    "query_26": "Automated response for query 26, providing details on real estate.",
    "query_27": "Automated response for query 27, providing details on real estate.",
    "query_28": "Automated response for query 28, providing details on real estate.",
    "query_29": "Automated response for query 29, providing details on real estate.",
    "query_30": "Automated response for query 30, providing details on real estate.",
    "query_31": "Automated response for query 31, providing details on real estate.",
    "query_32": "Automated response for query 32, providing details on real estate.",
    "query_33": "Automated response for query 33, providing details on real estate.",
    "query_34": "Automated response for query 34, providing details on real estate.",
    "query_35": "Automated response for query 35, providing details on real estate.",
    "query_36": "Automated response for query 36, providing details on real estate.",
    "query_37": "Automated response for query 37, providing details on real estate.",
    "query_38": "Automated response for query 38, providing details on real estate.",
    "query_39": "Automated response for query 39, providing details on real estate.",
    "query_40": "Automated response for query 40, providing details on real estate."
}